{

  "sections": [
    { "name":"About Me" },
    { "name":"Where I&apos;ve Studied" },
    { "name":"Where I&apos;ve Worked" }
  ],

  "about": [
    { "para":"I&apos;m an experienced software engineer, where I have specialized in developing and maintain the Store Platform at Gilt, using technologies such as Scala, Handlebars, Backbone, Node.js, LESS, CSS, jQuery and Javascript." },
    { "para":"I&apos;ve also have had vast experience in writing test automation using a combination of Java, Python, WebDriver API, Scala and custom frameworks based around TestNG and JUnit." },
    { "para":"I&apos;ve experience leading projects and managing releases, as well as managing offshore QA engineers. I&apos;ve worked within Agile and Waterfall development cycles." },
    { "para":"I&apos;m extremely passionate about quality and ensuring that the user receives the best possible experience when using software that we provide them; I look at things from a user&apos;s point of view to help deliver on this." },
    { "para":"I&apos;ve spent the last number of years working in quality and development roles to enable me to build a fundamental understanding of web practices and web technologies such as JavaScript. This learning has also enabled me to identify complex problems and solve this with creative solutions. I&apos;ve created a lot of security patches to Gilt.com to ensure user safety." },
    { "para":"I&apos;ve experience leading multiple projects at once such as the engineering effort of Microsoft Office for Mac 2008 SP2 and the release of the monthly patch release of Microsoft Office 2004." }
  ],

  "education": [
    {
      "uniName":"Trinity College Dublin",
      "course":"BSc. Computer Science",
      "gradYear":"2007",
      "fyProject": "Dynamic Web Pages - I created a RSS web system using PHP and MySQL to allow lecturers and student interactive on important course information like lecture changes, assignment date changes etc."
    },
    {
      "uniName":"Dublin Institute of Technology",
      "course":"Diploma in Computer Science",
      "gradYear":"2003",
      "fyProject": "Inventory Tracking System - I created an inventory system using ASP and SQL to allow companies keep track of hardware, software and allow management to create reports on inventory levels."
    }
  ],

  "employers": [
    {
      "companyName":"Sohalo Inc.",
      "position":"Senior QA Engineer",
      "duration":"December 2013 to Present",
      "tasks": [
        { "item":"Implemented an automation framework to test the Sohalo API’s on a daily basis in Jenkins." },
        { "item":"Expanded (planned and implemented) the aforementioned framework to run Selenium tests." },
        { "item":"Integrated the php-webdriver bindings to replace the PHPUnit Selenium Extension, which contains better functionality and more flexibility." },
        { "item":"Currently in the planning phase of implementing Test-Driven Development in the Software Development Life Cycle." }
      ]
    },
    {
      "companyName":"Mozilla",
      "position":"Contributor to WebQA",
      "duration":"February 2012 to February 2014",
      "tasks": [
        { "item":"Was owner of the WebQA Wiki Test suite." },
        { "item":"Restructured the wiki project to match other WebQA project structures." },
        { "item":"Develop automated tests for the WebQA Wiki site, https://github.com/mozilla/wiki-tests/." },
        { "item":"Update and review documentation on the Mozilla QMO site." }
      ]
    },
    {
      "companyName":"Gilt Groupe",
      "position":"Software Engineer",
      "duration":"July 2011 to December 2013",
      "tasks": [
        { "item":"Planning and implementing new ways to drive traffic through the different stores applications on Gilt.com." },
        { "item":"Implementing end-to-end features on Gilt.com such as the Shop By Age widget on the Kids store front." },
        { "item":"Develop and maintain the existing store platform." },
        { "item":"Automated testing of the store platform in the form of unit tests or front-end selenium tests." },
        { "item":"Drove the automation pass rate from ~60% on 1 environment to over 90% across 3 environments (Local, Grid & Sauce)." },
        { "item":"Investigate and fix any automation failures for the Business Operations project using innovative solutions. I recently implemented a new way to test our web services." },
        { "item":"Manage the Business Operations project releases on a bi-weekly basis, which involves managing off-site QA engineers." },
        { "item":"Assist team members with automation queries and best practices. I’m also a Mentor in the Gilt Mentoring program." },
        { "item":"Continued development of automated tests for the Business Operations team, which required very quick turnaround." }
      ]
    },
    {
      "companyName":"NewBay",
      "position":"Senior Test Engineer",
      "duration":"December 2010 to July 2011",
      "tasks": [
        { "item":"Developed automated test suites for Mobile Telecoms web based systems." },
        { "item":"Collaborated effectively across the business to ensure features were created and tested as per the customers request." },
        { "item":"Was involved with the migration of our JIRA system, carrying out essential tasks within tight timelines." }
      ]
    },
    {
      "companyName":"Sage CRM",
      "position":"QA Engineer",
      "duration":"February 2010 to December 2010",
      "tasks": [
        { "item":"Drove the initial effect of running Sage CRM Cloud Platform." },
        { "item":"Participated in feature plans and owned the QA effort for core features." },
        { "item":"Owned and Day to day testing of certain areas of Sage CRM such as Interactive Dashboard and Reports." },
        { "item":"Investigated issue with Sage CRM installations across different platforms." },
        { "item":"Responsible for maintaining the QA department’s VM farm." }
      ]
    },
    {
      "companyName":"Microsoft",
      "position":"International Project Engineer (Software Engineer)",
      "duration":"December 2006 to February 2010",
      "tasks": [
        { "item":"Owned and drove Excel for Mac for the MacBU from a localization engineering perspective." },
        { "item":"Optimized and improved weekly code base preparation from +4hrs down to 1.5hrs. " },
        { "item":"Reviewed and provided technical input into feature specifications, identifying and prioritizing localizability requirements and pushing them upstream." },
        { "item":"Identified, resolved and provided root cause analysis for Excel issues." },
        { "item":"Led and drove the localization engineering effect for Office for Mac 2008 Service Pack 2." },
        { "item":"Advocate for the local market customer in all areas of design, code and operations." },
        { "item":"Collaborated effectively with Engineers and Program Managers across geographies, languages and cultures." },
        { "item":"Owed and drove the localization engineering monthly service release for Office for Mac 2004 across 6 different languages." }
      ]
    },
    {
      "companyName":"Microsoft",
      "position":"Software Test/Localization Engineer",
      "duration":"March 2006 to December 2006",
      "tasks": [
        { "item":"Reviewed and rewrote the test case management system with a more secure, reliable, customizable and user-friendly system." },
        { "item":"Developed a statistics website to view reports on testing progress. This allowed management to track the teams progress from a single location." },
        { "item":"Managed the localization of the microsoft.com marketing sites for the Encarta suite." },
        { "item":"Worked with external localizers, managing the schedules, working with the Sub PM’s to review the marketing sites." },
        { "item":"Coordinated the testing of the localized marking sites and tracking bugs." },
        { "item":"Wrote test plans for different areas of the Microsoft Encarta suite." },
        { "item":"Review all specs at ‘mid-stability’ and send feedback to the feature PM to make sure that International issues are represented prior to development stage." }
      ]
    },
    {
      "companyName":"Vodafone",
      "position":"Product & Services Developer (Web Developer)",
      "duration":"March 2003 to March 2006",
      "tasks": [
        { "item":"Developed web solutions (including creating graphics) from Marketing approved requests for Vodafone websites (Internal &amp; External)."},
        { "item":"Developed, tested and deployed fixes to Vodafone live! (Vodafone’s Mobile Web portal) for any new/existing devices in the Vodafone range. " },
        { "item":"Install, tested and deployed 3rd Party applications on the Vodafone live! Pre-Production/Test servers such as Google Search, Sky Sports and RTE News services." },
        { "item":" Was Technology Lead for the Off-net Content Filter project which differentiated the content available to customers based on their age profile and device." },
        { "item":"Collaborated effectively with my counterparts in the UK and Germany on Device handset profile issues that existed in the different Vodafone markets." }
      ]
    },
    {
      "companyName":"Vodafone",
      "position":"Customer Service Representative",
      "duration":"July 2002 to March 2003",
      "tasks": [
        { "item":"Provided front line customer support by telephone or email/web." },
        { "item":"Provided quick response support to customer inquiries and complaints." },
        { "item":"Direct requests and unresolved issues to the designated resource." },
        { "item":"Collaborated effectively with internal departments to ensure a satisfactory outcome for the customer." }
      ]
    },
    {
      "companyName":"Microsoft",
      "position":"Senior Test Engineer",
      "duration":"June 2000 to June 2001"
    },
    {
      "companyName":"Microsoft",
      "position":"Release Team Member",
      "duration":"June 1999 to September 1999"
    }
  ],

  "footer": [
    {
      "copyright":"&copy;2014 - Glenn Howard",
      "email":"<a href=\"mailto:glennrphoward@gmail.com\">glennrphoward@gmail.com</a>",
      "phone":"<a href=\"tel:+353861228781\">+353 86 1228781</a>"
    }
  ]
}
