{

  "about": [
    { "para":"I’m an experienced Software Engineer, with experiences delivering elegant and innovative full stack solutions and services, looking to formalise my move in Product Management." },
    { "para":"I’ve shipped high scale applications so know what is needed and required. This would enable me to transfer my technical knowledge over into the Product Management function and deliver a high quality consumer experiences reliably within a fast paced agile environment. I’m extremely passionate about quality and ensuring that the user receives the best possible experience when using software that we provide them; I look at things from a user’s point of view to help deliver on this." },
    { "para":"I’ve experience leading multiple projects at once, such as the engineering effort of Microsoft Office for Mac 2008 SP2 and the releases of the monthly patch of Microsoft Office 2004, which enables me to working collaboratively with my team and key partner teams on a global scale." },
    { "para":"I’ve managed the localization of the Encarta microsoft.com marketing sites which involved collaborating with external localizers, managing schedules, working with the Sub PM’s to review the sites, co-coordinating the testing of the localized sites and tracking bugs." },
    { "para":"I’ve spent the last number of years working in fast paced environments, in a number of quality and development roles to enable me to solve tough problems and build a fundamental understanding of web practices, mobile platforms and web technologies. This learning has also enabled me to identify complex problems and solve this with creative innovative solutions." },
    { "para":"Having worked in fast paced environments, such as Gilt and contributing at Mozilla, and with the skills I've acquired in all those roles, I feel I would be able to hit to ground running and make a real impact." }
  ],

  "education": [
    {
      "uniName":"Trinity College Dublin",
      "course":"BSc. Computer Science",
      "gradYear":"2007",
      "fyProject": "Final Year Project: Dynamic Web Pages - I created a RSS web system using PHP and MySQL to allow lecturers and student interactive on important course information like lecture changes, assignment date changes etc."
    },
    {
      "uniName":"Dublin Institute of Technology",
      "course":"Diploma in Computer Science",
      "gradYear":"2003",
      "fyProject": "Final Year Project: Inventory Tracking System - I created an inventory system using ASP and SQL to allow companies keep track of hardware, software and allow management to create reports on inventory levels.",
      "activities": [
          { "item":"Activities: I was President of the DIT Kevin St Rugby Club. This role involved liaising with inter-DIT staff and students. I also brought in sponsorship deals (kits and entertainment) with Ericsson, Heineken, Planet Murphy & Palace Nightclub and the Redbox."}
        ]
    }
  ],

  "employers": [
    {
      "id":"1",
      "companyName":"Sohalo Inc.",
      "position":"Senior Software Engineer",
      "duration":"December 2013 to present",
      "tasks": [
        { "item":"Designed, implemented our Unit Test and WebDriver frameworks to test Sohalo’s code base." },
        { "item":"Introduced and run weekly QA automation sprint planning meetings." },
        { "item":"Champion QA across the organization, raising issues and suggesting best practices to implement." },
        { "item":"Create Feature tickets (including mock-ups) with improvements based off requirements and UX."},
        { "item":"Contribute to the product roadmap and determine requirements for releases."}
      ]
    },
    {
      "id":"2",
      "companyName":"Mozilla",
      "position":"Community Lead for WebQA Wiki-Test project",
      "duration":"September 2014 to present",
      "tasks": [
        { "item":"Work on wiki-test automation issues and encourage community contributors to take on issues." },
        { "item":"Review automation xfails (on purpose test failures due to bugs) on a monthly basis and action as required." },
        { "item":"Attend project meetings, keep wider WebQA team up-to-date on wiki progress and plan for required work tasks." },
        { "item":"Help build the community via IRC and blog posts about the project, new features and update." }
      ]
    },
    {
      "id":"3",
      "companyName":"Mozilla",
      "position":"Contributor to WebQA",
      "duration":"February 2012 to present",
      "tasks": [
        { "item":"Current owner of the WebQA Wiki Test suite." },
        { "item":"Restructured the wiki project to match other WebQA project structures." },
        { "item":"Develop automated tests for the WebQA Wiki site, https://github.com/mozilla/wiki-tests/." },
        { "item":"Update and review documentation on the Mozilla QMO site." }
      ]
    },
    {
      "id":"4",
      "companyName":"Gilt Groupe",
      "position":"Software Engineer",
      "duration":"July 2011 to December 2013",
      "tasks": [
        { "item":"Planned and implemented new ways to drive traffic through the different stores applications on Gilt.com." },
        { "item":"Implemented full stack features on Gilt.com such as the Shop By Age widget on the Kids storefront, menu navigation improvement and security fixes." },
        { "item":"Drove down the number of security tickets opened against the Gilt website by using intuitive software fixes" },
        { "item":"Automated testing of the store platform in the form of unit tests or front-end selenium tests." },
        { "item":"Drove the automation pass rate from ~60% on 1 environment to over 90% across 3 environments (Local, Grid & Sauce)." },
        { "item":"Investigated and fixed any automation failures for the Business Operations project using innovative solutions. I recently implemented a new way to test our web services." },
        { "item":"Managed the Business Operations project releases on a bi-weekly basis, which involves managing off-site QA engineers." },
        { "item":"Assisted team members with automation queries and best practices. I’m also a Mentor in the Gilt Mentoring program." },
        { "item":"Continued development of automated tests for the Business Operations team, which required very quick turnaround." }
      ]
    },
    {
      "id":"5",
      "companyName":"NewBay",
      "position":"Senior Test Engineer",
      "duration":"December 2010 to July 2011",
      "tasks": [
        { "item":"Developed automated test suites for Mobile Telecoms web based systems." },
        { "item":"Collaborated effectively across the business to ensure features were created and tested as per the customers request." },
        { "item":"Was involved with the migration of our JIRA system, carrying out essential tasks within tight timelines." }
      ]
    },
    {
      "id":"6",
      "companyName":"Sage CRM",
      "position":"QA Engineer",
      "duration":"February 2010 to December 2010",
      "tasks": [
        { "item":"Drove the initial effect of running Sage CRM Cloud Platform." },
        { "item":"Participated in feature plans and owned the QA effort for core features." },
        { "item":"Owned and Day to day testing of certain areas of Sage CRM such as Interactive Dashboard and Reports." },
        { "item":"Investigated issue with Sage CRM installations across different platforms." },
        { "item":"Responsible for maintaining the QA department’s VM farm." }
      ]
    },
    {
      "id":"7",
      "companyName":"Microsoft",
      "position":"International Project Manager",
      "duration":"December 2006 to February 2010",
      "tasks": [
        { "item":"Owned and drove Excel for Mac for the MacBU from a localization engineering perspective." },
        { "item":"Optimized and improved weekly code base preparation from +4hrs down to 1.5hrs. " },
        { "item":"Reviewed and provided technical input into feature specifications, identifying and prioritizing localizability requirements and pushing them upstream." },
        { "item":"Identified, resolved and provided root cause analysis for Excel issues." },
        { "item":"Led and drove the localization engineering effect for Office for Mac 2008 Service Pack 2." },
        { "item":"Advocate for the local market customer in all areas of design, code and operations." },
        { "item":"Collaborated effectively with Engineers and Program Managers across geographies, languages and cultures." },
        { "item":"Owed and drove the localization engineering monthly service release for Office for Mac 2004 across 6 different languages." }
      ]
    },
    {
      "id":"8",
      "companyName":"Microsoft",
      "position":"Software Test/Localization Engineer",
      "duration":"March 2006 to December 2006",
      "tasks": [
        { "item":"Reviewed and rewrote the test case management system with a more secure, reliable, customizable and user-friendly system." },
        { "item":"Developed a statistics website to view reports on testing progress. This allowed management to track the teams progress from a single location." },
        { "item":"Managed the localization of the microsoft.com marketing sites for the Encarta suite." },
        { "item":"Worked with external localizers, managing the schedules, working with the Sub PM’s to review the marketing sites." },
        { "item":"Coordinated the testing of the localized marking sites and tracking bugs." },
        { "item":"Wrote test plans for different areas of the Microsoft Encarta suite." },
        { "item":"Review all specs at ‘mid-stability’ and send feedback to the feature PM to make sure that International issues are represented prior to development stage." }
      ]
    },
    {
      "id":"9",
      "companyName":"Vodafone",
      "position":"Software Engineer",
      "duration":"March 2003 to March 2006",
      "tasks": [
        { "item":"Developed web solutions (including creating graphics) from Marketing approved requests for Vodafone websites (Internal &amp; External)."},
        { "item":"Developed, tested and deployed fixes to Vodafone live! (Vodafone’s Mobile Web portal) for any new/existing devices in the Vodafone range. " },
        { "item":"Install, tested and deployed 3rd Party applications on the Vodafone live! Pre-Production/Test servers such as Google Search, Sky Sports and RTE News services." },
        { "item":" Was Technology Lead for the Off-net Content Filter project which differentiated the content available to customers based on their age profile and device." },
        { "item":"Collaborated effectively with my counterparts in the UK and Germany on Device handset profile issues that existed in the different Vodafone markets." }
      ]
    },
    {
      "id":"10",
      "companyName":"Vodafone",
      "position":"Customer Service Representative",
      "duration":"July 2002 to March 2003",
      "tasks": [
        { "item":"Provided front line customer support by telephone or email/web." },
        { "item":"Provided quick response support to customer inquiries and complaints." },
        { "item":"Direct requests and unresolved issues to the designated resource." },
        { "item":"Collaborated effectively with internal departments to ensure a satisfactory outcome for the customer." }
      ]
    },
    {
      "id":"11",
      "companyName":"Microsoft",
      "position":"Senior Test Engineer",
      "duration":"June 2000 to June 2001"
    },
    {
      "id":"12",
      "companyName":"Microsoft",
      "position":"Release Team Member",
      "duration":"June 1999 to September 1999"
    }
  ]
}
